Revit 2027 API
MechanicalEquipmentSet.GetMembers Method
 Gets member element ids for the mechanical equipment set.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ISet<ElementId> GetMembers()
Public Function GetMembers As ISet(Of ElementId)
public:
ISet<ElementId^>^ GetMembers()
member GetMembers : unit -> ISet<ElementId>
Return Value
ISet<ElementId>
 Element ids for the members in the mechanical equipment set.
See Also
Reference
MechanicalEquipmentSet Class
Autodesk.Revit.DB.Mechanical Namespace